**Домашнее задание**

**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [9]:
data = pd.read_csv('movies.csv')
data.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [16]:
data2 = pd.read_csv('ratings.csv')
data2.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [10]:
data_all = data2.merge(data, on='movieId', how='left')
data_all.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [31]:
a = data_all[(data_all['rating'] == 5.0)]
a.head(5)

,userId,movieId,rating,timestamp,title,genres
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
6,1,101,5.0,964980868,Bottle Rocket (1996),Adventure|Comedy|Crime|Romance
8,1,151,5.0,964984041,Rob Roy (1995),Action|Drama|Romance|War
9,1,157,5.0,964984100,Canadian Bacon (1995),Comedy|War

In [30]:
a.groupby('title').count().sort_values('rating', ascending=False).head(1)

                                  userId  movieId  rating  timestamp  genres
title
Shawshank Redemption, The (1994)     153      153     153        153     153

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [32]:
data_power = pd.read_csv('power.csv')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [35]:
data_power[ data_power['country'].str.contains('Estonia', case=False) ]['country'].unique()

array(['Estonia'], dtype=object)

In [70]:
data_power_new = data_power[ ((data_power['country'] == 'Latvia') | (data_power['country'] == 'Lithuania') | (data_power['country'] == 'Estonia')) &\
                             ((data_power['category'] == 4) | (data_power['category'] == 12) | (data_power['category'] == 21)) & \
                           ((data_power['year'] >= 2005) & (data_power['year'] <= 2010)) & (data_power['quantity'] > 0)]

data_power_new.sort_values(by='quantity', ascending=True).head(5)

a = data_power_new['quantity'].sum()

print('Cуммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 года составило - ', a)

Cуммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 года составило -  240580.0

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти): 
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni
https://www.moex.com/

In [87]:
table = pd.read_html('https://fortrader.org/quotes')[1]

In [86]:
print(table)

                          Type      Last    Chg.  Chg.%  Time
0      Серебро Цена на серебро    17.457   0.003  0.017   NaN
1    Палладий Цена на Палладий  2173.500  -5.550 -0.250   NaN
2  Золото Цена золота на бирже  1570.430   3.370  0.220   NaN
3      Платина Цены на платину   974.100 -14.700 -1.500   NaN
4      Медь Цена меди на бирже     2.561  -0.026 -1.005   NaN

In [88]:
type(table)

pandas.core.frame.DataFrame